# Sesion 4

# 1 Reshape

In [17]:
import numpy as np
from time import time

In [4]:
x = np.arange(1,11,1)

In [5]:
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [6]:
x.shape

(10,)

In [7]:
np.reshape(x, (2,5))

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10]])

In [8]:
np.reshape(x, (5,2))

array([[ 1,  2],
       [ 3,  4],
       [ 5,  6],
       [ 7,  8],
       [ 9, 10]])

In [9]:
np.reshape(x, (10,1))

array([[ 1],
       [ 2],
       [ 3],
       [ 4],
       [ 5],
       [ 6],
       [ 7],
       [ 8],
       [ 9],
       [10]])

In [10]:
np.reshape(x, (-1,1))

array([[ 1],
       [ 2],
       [ 3],
       [ 4],
       [ 5],
       [ 6],
       [ 7],
       [ 8],
       [ 9],
       [10]])

In [13]:
np.reshape(x, (1,10))

array([[ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10]])

In [14]:
x

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

# 2. Performance

In [18]:
x = np.linspace(1, 10000000, 20000000) 
b0 = 5
b1 = 2

In [24]:
y = np.empty_like(x)

inicio = time()
for index, value in enumerate(x):
    y[index] = b0 + b1*value
fin = time()

In [27]:
print("El tiempo total es: ", fin - inicio)

El tiempo total es:  15.141444206237793

In [28]:
x = np.arange(1,6,1)
x

array([1, 2, 3, 4, 5])

In [ ]:
# se usará en el proyecto, calcular el error y - y estimado

In [32]:
vect1 = np.ones_like(x).reshape((-1,1))
x_stack = x.reshape((-1,1))
A = np.hstack([vect1,x_stack])
A

array([[1, 1],
       [1, 2],
       [1, 3],
       [1, 4],
       [1, 5]])

In [33]:
betas = np.array([[b0], [b1]])

inicio = time()
y1 = np.matmul(A, betas)
fin = time()

print("El tiempo es; ", fin - inicio)

El tiempo es;  0.04488396644592285

In [ ]:
# hasta aquí

# 3. Pandas - (Panel Data)

In [34]:
import numpy as np
import pandas as pd

In [36]:
data = np.random.rand(10)
data

array([0.32271966, 0.42184448, 0.55529454, 0.22789117, 0.93771475,
       0.32246275, 0.35125481, 0.96115026, 0.73455102, 0.66889847])

In [35]:
# El data Frame es un conjunto de columnas de series
pd.Series(np.random.rand(10))

0    0.946361
1    0.811756
2    0.857564
3    0.156244
4    0.173497
5    0.664027
6    0.744387
7    0.242457
8    0.603769
9    0.611562
dtype: float64

In [38]:
pd.Series(data, index=np.arange(10, 110, 10))

10     0.322720
20     0.421844
30     0.555295
40     0.227891
50     0.937715
60     0.322463
70     0.351255
80     0.961150
90     0.734551
100    0.668898
dtype: float64

In [39]:
diccionario = {'A':30,'B':60, 'C':'Hola', 'D':np.exp(5)}
diccionario

{'A': 30, 'B': 60, 'C': 'Hola', 'D': 148.4131591025766}

In [40]:
pd.Series(diccionario)

A            30
B            60
C          Hola
D    148.413159
dtype: object

In [42]:
d = { 'columnaA': [10, 20, 30, 40],
         'columnaB': pd.Series(['abc', 10.5, 34, 'xy']),
         'columnaC': pd.Series([10.45, 89.34, 90.76, 24.89])
     }

In [43]:
df1 = pd.DataFrame(d)

In [44]:
df1

   columnaA columnaB  columnaC
0        10      abc     10.45
1        20     10.5     89.34
2        30       34     90.76
3        40       xy     24.89

In [45]:
#Qué tipo de dato es cada columna
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   columnaA  4 non-null      int64
 1   columnaB  4 non-null      object
 2   columnaC  4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [46]:
type(df1['columnaB'])

pandas.core.series.Series

In [47]:
df1[['columnaA','columnaC']]

   columnaA  columnaC
0        10     10.45
1        20     89.34
2        30     90.76
3        40     24.89

In [48]:
df1[['columnaC','columnaA']]

   columnaC  columnaA
0     10.45        10
1     89.34        20
2     90.76        30
3     24.89        40

In [50]:
#extraemos información en base al nombre de la fila(index) y la columna
df1.loc[[0,1,3],['columnaC', 'columnaA']]

   columnaC  columnaA
0     10.45        10
1     89.34        20
3     24.89        40

In [51]:
#extraemos información en base al nombre de la fila(index) y la columna
df1.iloc[[0,1,3],[2,0]]

   columnaC  columnaA
0     10.45        10
1     89.34        20
3     24.89        40

In [52]:
#nueva columna
df1['nueva']= df1['columnaA'] + df1['columnaC']
df1

   columnaA columnaB  columnaC   nueva
0        10      abc     10.45   20.45
1        20     10.5     89.34  109.34
2        30       34     90.76  120.76
3        40       xy     24.89   64.89

In [ ]:
#eliminar filas/columnas drop(indice/columna, axis (0 fila, columna 1))
#drop.nan
df1.drop(0, axis=0)

In [ ]:
"""
    afecta la original
    inplace = True --> modifica la variable original con la
    operación aplicada
"""
df1.drop(0, axis=0, inplace = True)

# 3.1 Filtros

In [53]:
df2 = pd.DataFrame({
    'A': np.random.randint(1, 20, size=10),
    'B': np.random.randint(1, 20, size=10)
})

df2

    A   B
0  15  16
1  14   3
2   2  15
3  16  17
4  17   3
5  10  18
6  17   1
7   2   7
8   1   6
9  15   9

In [55]:
df2[df2['A'] > 10]

    A   B
0  15  16
1  14   3
3  16  17
4  17   3
6  17   1
9  15   9

In [56]:
df2['A'] >10

0     True
1     True
2    False
3     True
4     True
5    False
6     True
7    False
8    False
9     True
Name: A, dtype: bool

In [58]:
df2[(df2['A'] > 7) & (df2['B'] < 10)]

    A  B
1  14  3
4  17  3
6  17  1
9  15  9

In [60]:
df1.loc[:,['columnaB']]

  columnaB
0      abc
1     10.5
2       34
3       xy

In [61]:
df1.loc[[0,2],['columnaB']]

  columnaB
0      abc
2       34

# 3.2 Operaciones de Agregación

In [62]:
df = pd.DataFrame({'col1': [10,20,30,40,50,60], 
                   'col2':[1,2,3,4,5,6], 
                   'col3':['A', 'B', 'C', 'D', 'A', 'F']})

df

   col1  col2 col3
0    10     1    A
1    20     2    B
2    30     3    C
3    40     4    D
4    50     5    A
5    60     6    F

In [63]:
df['col1'].sum()

210

In [64]:
#axis = 0  - operación sobre columnas
#axis = 1  - operación sobre fila (indices)
df[['col1','col2']].sum(axis=1)

0    11
1    22
2    33
3    44
4    55
5    66
dtype: int64

In [65]:
df[['col1','col2']].sum(axis=0)

col1    210
col2     21
dtype: int64

In [66]:
#cuenta cantidad de valores, mas de uno si se repite
df['col3'].value_counts()

col3
A    2
B    1
C    1
D    1
F    1
Name: count, dtype: int64

In [67]:
#Cuenta cantidad de filas en la columna
df['col2'].count()

6

In [68]:
#devuelve el arreglo con nombres de columnas
df['col2'].values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [70]:
dataset = pd.read_csv("hotel_bookings.csv")
dataset.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304.0,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240.0,NaN,0,Transient,98.0,0,1,Check-Out,2015-07-03

In [71]:
dataset.shape

(119390, 32)

In [72]:
dataset.dtypes

hotel                              object
is_canceled                         int64
lead_time                           int64
arrival_date_year                   int64
arrival_date_month                 object
arrival_date_week_number            int64
arrival_date_day_of_month           int64
stays_in_weekend_nights             int64
stays_in_week_nights                int64
adults                              int64
children                          float64
babies                              int64
meal                               object
country                            object
market_segment                     object
distribution_channel               object
is_repeated_guest                   int64
previous_cancellations              int64
previous_bookings_not_canceled      int64
reserved_room_type                 object
assigned_room_type                 object
booking_changes                     int64
deposit_type                       object
agent                             float64
company                           float64
days_in_waiting_list                int64
customer_type                      object
adr                               float64
required_car_parking_spaces         int64
total_of_special_requests           int64
reservation_status                 object
reservation_status_date            object
dtype: object

In [73]:
dataset.describe()

,is_canceled,lead_time,arrival_date_year,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,children,babies,is_repeated_guest,previous_cancellations,previous_bookings_not_canceled,booking_changes,agent,company,days_in_waiting_list,adr,required_car_parking_spaces,total_of_special_requests
count,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,119386.000000,119390.000000,119390.000000,119390.000000,119390.000000,119390.000000,103050.000000,6797.000000,119390.000000,119390.000000,119390.000000,119390.000000
mean,0.370416,104.011416,2016.156554,27.165173,15.798241,0.927599,2.500302,1.856403,0.103890,0.007949,0.031912,0.087118,0.137097,0.221124,86.693382,189.266735,2.321149,101.831122,0.062518,0.571363
std,0.482918,106.863097,0.707476,13.605138,8.780829,0.998613,1.908286,0.579261,0.398561,0.097436,0.175767,0.844336,1.497437,0.652306,110.774548,131.655015,17.594721,50.535790,0.245291,0.792798
min,0.000000,0.000000,2015.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,6.000000,0.000000,-6.380000,0.000000,0.000000
25%,0.000000,18.000000,2016.000000,16.000000,8.000000,0.000000,1.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,9.000000,62.000000,0.000000,69.290000,0.000000,0.000000
50%,0.000000,69.000000,2016.000000,28.000000,16.000000,1.000000,2.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,14.000000,179.000000,0.000000,94.575000,0.000000,0.000000
75%,1.000000,160.000000,2017.000000,38.000000,23.000000,2.000000,3.000000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,229.000000,270.000000,0.000000,126.000000,0.000000,1.000000
max,1.000000,737.000000,2017.000000,53.000000,31.000000,19.000000,50.000000,55.000000,10.000000,10.000000,1.000000,26.000000,72.000000,21.000000,535.000000,543.000000,391.000000,5400.000000,8.000000,5.000000

In [74]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119390 entries, 0 to 119389
Data columns (total 32 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   hotel                           119390 non-null  object
 1   is_canceled                     119390 non-null  int64
 2   lead_time                       119390 non-null  int64
 3   arrival_date_year               119390 non-null  int64
 4   arrival_date_month              119390 non-null  object
 5   arrival_date_week_number        119390 non-null  int64
 6   arrival_date_day_of_month       119390 non-null  int64
 7   stays_in_weekend_nights         119390 non-null  int64
 8   stays_in_week_nights            119390 non-null  int64
 9   adults                          119390 non-null  int64
 10  children                        119386 non-null  float64
 11  babies                          119390 non-null  int64
 12  meal                            119390 non-null  object
 13  country                         118902 non-null  object
 14  market_segment                  119390 non-null  object
 15  distribution_channel            119390 non-null  object
 16  is_repeated_guest               119390 non-null  int64
 17  previous_cancellations          119390 non-null  int64
 18  previous_bookings_not_canceled  119390 non-null  int64
 19  reserved_room_type              119390 non-null  object
 20  assigned_room_type              119390 non-null  object
 21  booking_changes                 119390 non-null  int64
 22  deposit_type                    119390 non-null  object
 23  agent                           103050 non-null  float64
 24  company                         6797 non-null    float64
 25  days_in_waiting_list            119390 non-null  int64
 26  customer_type                   119390 non-null  object
 27  adr                             119390 non-null  float64
 28  required_car_parking_spaces     119390 non-null  int64
 29  total_of_special_requests       119390 non-null  int64
 30  reservation_status              119390 non-null  object
 31  reservation_status_date         119390 non-null  object
dtypes: float64(4), int64(16), object(12)
memory usage: 29.1+ MB

In [76]:
dataset['is_canceled'].value_counts()

is_canceled
0    75166
1    44224
Name: count, dtype: int64

In [77]:
dataset['lead_time'].value_counts()

lead_time
0      6345
1      3460
2      2069
3      1816
4      1715
       ...
400       1
370       1
532       1
371       1
463       1
Name: count, Length: 479, dtype: int64